{
  "data": {
    "site": {
      "siteMetadata": { "title": "Get. Shit. Done.", "author": "David O'Regan" }
    },
    "markdownRemark": {
      "id": "5f76ec03-61e2-55d6-99bc-6aba2bcb87b5",
      "excerpt": "So, at some point in your career as a software developer, you’re going to run into a moment of:  . Don’t panic, it’s a normal reaction and a cross roads we all…",
      "html": "<p>So, at some point in your career as a software developer, you’re going to run into a moment of: <code class=\"language-text\">Shit, deploy or keep tweaking?</code>. Don’t panic, it’s a normal reaction and a cross roads we all come to eventually.</p>\n<p>If you think of yourself as a good developer, you probably spend a lot of time trying to improve the quality of your own code. Even if you dont think you’re a particulary good developer, I bet you still spend a lot of time trying to write the <em>best</em> code.</p>\n<ul>\n<li>You spend time reading best practices from your developer heros - Looking at you <a href=\"http://jussi.hallila.com/\">Jussi Hallila</a>.</li>\n<li>You refractor your old awful code time and time again.</li>\n<li>-</li>\n</ul>\n<p>And so, we spend a lot of time and energy trying to perfect our own craft, writing code that other people will awe at but how does this type of idealism stack up in the real world against business requirements?</p>\n<p>In my experience, theres a bit of a disconect between what developers feel they need to deliver and what we actually need to deliver.</p>\n<p>Why though?</p>\n<p>Sometimes we like to feel smart, sometimes we want to prove we know what we’re doing, sometimes we need to push ourseleves. None of these motivations however relate at all to buisness value delivered. </p>\n<p>It encourages readable, correct and performant code, and helps developers fall into <a href=\"https://blog.codinghorror.com/falling-into-the-pit-of-success/\">the pit of success</a>.</p>",
      "timeToRead": 1,
      "frontmatter": {
        "title": "Being Ok With Deploying Shitty Code",
        "date": "February 01, 2019"
      }
    }
  },
  "pageContext": { "slug": "/my-second-post/", "previous": null, "next": null }
}
